print('Задача 10. Максимальное число (по желанию)')

# Пользователь вводит три числа.
# Напишите программу,
# которая выводит на экран максимальное из этих трёх чисел (все числа разные).
# Можно использовать дополнительные переменные, если нужно 

number_1 = int(input("Введите перво число: "))
number_2 = int(input("Введите второе число: "))
number_3 = int(input("Введите третье число: "))
print(max(number_1,number_2,number_3))