print('Задача 6. Спецшифр')

# Два сотрудника спецслужб переписываются необычным шифром.
# Каждую букву они шифруют в виде строки,
# внутри которой есть длинная последовательность букв “s”, 
# а длина самой длинной - это и есть номер буквы алфавита, которую хотят отправить.
# 
# Напишите программу,
# которая получает на вход строку,
# подсчитывает в ней самую длинную последовательность подряд идущих букв “s” и выводит ответ на экран.
# 
# Пример:
# Введите строку: ssbbbsssbc
# Самая длинная последовательность: 3

text = input("Введите текст: ")
sum = 0
sum_total = 0

for letter in text:
  if letter == "s":
    sum += 1
    if sum > sum_total:
      sum_total = sum
  else:
    sum = 0
      
print("Самая длинна последовательность:", sum_total)   
  
