print('Задача 9. Коровы')

# Для коров есть 10 стойл.
# В каждом стойле разные условия для животных, поэтому и молока они дают по-разному.
# В первом стойле производят 2 литра в день,
# во втором 4, 
# в третьем - 6, потом 8, 10, 12, 14, 16, 18, 20. 
# Но коровы стоят не во всех стойлах. 
# Свободные и занятые обозначаются строкой из букв a и b,
# где a - свободное стойло, b - занятое.
# 
# Пользователь вводит строку из 10 символов a и b.
# Необходимо определить, сколько в итоге будет произведено молока за день.

quantity = input("Введите количество коров в стойлах а - свободное; b - занятое: ")
sum = 0
total_sum = 0

for cow in quantity:
  if cow == "b":
    sum += 2
    total_sum += sum
  else:
    sum += 2
print("Молока за день будет произведено:", total_sum)
    