print('Задача 5. Полёт')

# Что нужно сделать
# Напишите программу для сервиса заказа билетов,
# которая запрашивает у пользователя город вылета и город прилёта. 
# Затем выведите их в одну строку через тире. 
# Обратите внимание на свои переменные: названия должны отражать содержимое.

print('Для приобретения билетов Вам надо указать:')
print('Город вылета') 
_from = input('>>>  ')
print('Город прилета')
_to = input('>>>  ')
print(_from, '-',_to) 